In [1]:
# import the packages
from sqlalchemy import create_engine

In [2]:
# Run sql query
%load_ext sql

Connect to the database

In [3]:
%sql sqlite:///states.db

'Connected: @states.db'

## Staging tables

In [4]:
%%sql
SELECT * FROM airports LIMIT 5;

 * sqlite:///states.db
Done.

[('00AA', 'small_airport', 'Aero B Ranch Airport', 3435.0, 'KS', -101.4739, 38.704),
 ('00AK', 'small_airport', 'Lowell Field', 450.0, 'AK', -151.696, 59.9492),
 ('00AL', 'small_airport', 'Epps Airpark', 820.0, 'AL', -86.7703, 34.8648),
 ('00AS', 'small_airport', 'Fulton Airport', 1100.0, 'OK', -97.818, 34.9428),
 ('00AZ', 'small_airport', 'Cordes Airport', 3810.0, 'AZ', -112.165, 34.3056)]

In [5]:
%%sql
SELECT * FROM cities LIMIT 5;

 * sqlite:///states.db
Done.

[('Silver Spring', 'Maryland', 33.8, 40601, 41862, 82463, 1562, 30908, 2.6, 'MD', 1084.0, 8841.0, 21330.0, 25924.0, 37756.0),
 ('Quincy', 'Massachusetts', 41.0, 44129, 49500, 93629, 4147, 32935, 2.39, 'MA', 351.0, 30473.0, 3917.0, 2566.0, 58723.0),
 ('Hoover', 'Alabama', 38.5, 38040, 46799, 84839, 4819, 8229, 2.58, 'AL', None, 4759.0, 18191.0, 3430.0, 61869.0),
 ('Rancho Cucamonga', 'California', 34.5, 88127, 87105, 175232, 5821, 33878, 3.18, 'CA', 2789.0, 24519.0, 24437.0, 65823.0, 111832.0),
 ('Newark', 'New Jersey', 34.6, 138040, 143873, 281913, 5829, 86253, 2.73, 'NJ', 2268.0, 7349.0, 144961.0, 100432.0, 76402.0)]

In [6]:
%%sql
SELECT * FROM immigration LIMIT 5;

 * sqlite:///states.db
Done.

[('4084316', 2016, 4, '209', '209', 'HHW', '2016-04-22 00:00:00', 1, 'HI', '2016-04-29 00:00:00', 61, 2, 1, '2016-04-22 00:00:00', 'G', 'O', 'M', 1955, '2016-07-20 00:00:00', 'F', 'JL', '56582674633', '00782', 'WT'),
 ('4422636', 2016, 4, '582', '582', 'MCA', '2016-04-23 00:00:00', 1, 'TX', '2016-04-24 00:00:00', 26, 2, 1, '2016-04-23 00:00:00', 'G', 'R', 'M', 1990, '2016-10-22 00:00:00', 'M', '*GA', '94361995930', 'XBLNG', 'B2'),
 ('1195600', 2016, 4, '148', '112', 'OGG', '2016-04-07 00:00:00', 1, 'FL', '2016-04-27 00:00:00', 76, 2, 1, '2016-04-07 00:00:00', 'G', 'O', 'M', 1940, '2016-07-05 00:00:00', 'M', 'LH', '55780468433', '00464', 'WT'),
 ('5291768', 2016, 4, '297', '297', 'LOS', '2016-04-28 00:00:00', 1, 'CA', '2016-05-07 00:00:00', 25, 2, 1, '2016-04-28 00:00:00', 'G', 'O', 'M', 1991, '2016-10-27 00:00:00', 'M', 'QR', '94789696030', '00739', 'B2'),
 ('985523', 2016, 4, '111', '111', 'CHM', '2016-04-06 00:00:00', 3, 'NY', '2016-04-09 00:00:00', 19, 2, 1, '2016-04-06 00:00:00', 'Z', 'K', 'M', 1997, '2016-07-04 00:00:00', 'F', None, '42322572633', 'LAND', 'WT')]

In [7]:
%%sql
SELECT * FROM temperature LIMIT 5;

 * sqlite:///states.db
Done.

[('2003-01-01 00:00:00', 4.8, 0.1, 'Alabama'),
 ('2003-02-01 00:00:00', 9.1, 0.2, 'Alabama'),
 ('2003-03-01 00:00:00', 14.6, 0.2, 'Alabama'),
 ('2003-04-01 00:00:00', 17.8, 0.2, 'Alabama'),
 ('2003-05-01 00:00:00', 22.6, 0.2, 'Alabama')]

## Normalized tables

In [8]:
%%sql
SELECT * FROM dim_airports LIMIT 5

 * sqlite:///states.db
Done.

[('AL', 197), ('AR', 274), ('AZ', 214), ('CA', 547), ('CO', 289)]

In [9]:
%%sql
SELECT * FROM dim_cities LIMIT 5

 * sqlite:///states.db
Done.

[('AL', 36.2, 497248, 552381, 1049629, 71543, 52154, 2.4, 8084.0, 28769.0, 521068.0, 39313.0, 498920.0),
 ('AR', 32.8, 286479, 303400, 589879, 31704, 62108, 2.5, 11653.5, 24183.0, 191457.0, 87585.5, 401355.5),
 ('AZ', 35.0, 2227455, 2272087, 4499542, 264505, 682313, 2.8, 127030.5, 242774.5, 304314.0, 1464577.5, 3526621.5),
 ('CA', 36.2, 12278281, 12544179, 24822460, 928270, 7448257, 3.1, 404913.5, 4454238.5, 2098869.5, 9879765.0, 15089319.5),
 ('CO', 35.8, 1454619, 1481050, 2935669, 187896, 337631, 2.6, 57753.5, 169824.0, 190207.0, 685907.0, 2322769.0)]

In [10]:
%%sql
SELECT * FROM dim_temperature LIMIT 5

 * sqlite:///states.db
Done.

[('AL', 18.6, 26.9, 17.9, 8.4),
 ('AZ', 17.1, 26.5, 15.3, 6.1),
 ('AR', 17.3, 26.8, 16.6, 5.6),
 ('CA', 16.1, 23.4, 13.5, 7.2),
 ('CO', 8.6, 19.2, 7.0, -3.4)]

In [11]:
%%sql
SELECT * FROM fact_immigration LIMIT 5

 * sqlite:///states.db
Done.

[('4084316', 2016, 4, '209', '209', 'HHW', '2016-04-22 00:00:00', 1, 'HI', '2016-04-29 00:00:00', 61, 2, 1, '2016-04-22 00:00:00', 'G', 'O', 'M', 1955, '2016-07-20 00:00:00', 'F', 'JL', '56582674633', '00782', 'WT'),
 ('4422636', 2016, 4, '582', '582', 'MCA', '2016-04-23 00:00:00', 1, 'TX', '2016-04-24 00:00:00', 26, 2, 1, '2016-04-23 00:00:00', 'G', 'R', 'M', 1990, '2016-10-22 00:00:00', 'M', '*GA', '94361995930', 'XBLNG', 'B2'),
 ('1195600', 2016, 4, '148', '112', 'OGG', '2016-04-07 00:00:00', 1, 'FL', '2016-04-27 00:00:00', 76, 2, 1, '2016-04-07 00:00:00', 'G', 'O', 'M', 1940, '2016-07-05 00:00:00', 'M', 'LH', '55780468433', '00464', 'WT'),
 ('5291768', 2016, 4, '297', '297', 'LOS', '2016-04-28 00:00:00', 1, 'CA', '2016-05-07 00:00:00', 25, 2, 1, '2016-04-28 00:00:00', 'G', 'O', 'M', 1991, '2016-10-27 00:00:00', 'M', 'QR', '94789696030', '00739', 'B2'),
 ('985523', 2016, 4, '111', '111', 'CHM', '2016-04-06 00:00:00', 3, 'NY', '2016-04-09 00:00:00', 19, 2, 1, '2016-04-06 00:00:00', 'Z', 'K', 'M', 1997, '2016-07-04 00:00:00', 'F', None, '42322572633', 'LAND', 'WT')]